4ms/tf-a-stm32mp25/plat/st/stm32mp2/bl2_plat_setup.c
/*
 * Copyright (c) 2023-2025, STMicroelectronics - All Rights Reserved
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <assert.h>
#include <cdefs.h>
#include <errno.h>
#include <stdint.h>

#include <arch_helpers.h>
#include <common/debug.h>
#include <common/desc_image_load.h>
#include <drivers/clk.h>
#include <drivers/delay_timer.h>
#include <drivers/generic_delay_timer.h>
#include <drivers/mmc.h>
#include <drivers/st/bsec.h>
#include <drivers/st/regulator.h>
#include <drivers/st/regulator_fixed.h>
#include <drivers/st/stm32_console.h>
#include <drivers/st/stm32_hash.h>
#include <drivers/st/stm32_iwdg.h>
#include <drivers/st/stm32_rifsc.h>
#include <drivers/st/stm32_rng.h>
#include <drivers/st/stm32_uart.h>
#include <drivers/st/stm32mp_pmic2.h>
#include <drivers/st/stm32mp_reset.h>
#include <drivers/st/stm32mp_risab_regs.h>
#include <drivers/st/stm32mp2_ddr_helpers.h>
#include <drivers/st/stm32mp2_ram.h>
#include <drivers/st/stm32mp2_risaf.h>
#include <lib/fconf/fconf.h>
#include <lib/fconf/fconf_dyn_cfg_getter.h>
#include <lib/mmio.h>
#include <lib/optee_utils.h>
#include <lib/xlat_tables/xlat_tables_v2.h>
#include <plat/common/platform.h>

#include <platform_def.h>
#include <stm32mp_common.h>
#include <stm32mp_dt.h>
#include <stm32mp_io_storage.h>
#include <stm32mp2_context.h>

#define BOOT_CTX_ADDR	0x0e000020UL

IMPORT_SYM(uintptr_t, __BSS_START__, BSS_START);
IMPORT_SYM(uintptr_t, __BSS_END__, BSS_END);
IMPORT_SYM(uintptr_t, __DATA_START__, DATA_START);
IMPORT_SYM(uintptr_t, __DATA_END__, DATA_END);

#define IAC_EXCEPT_LSB_BIT(x) ((x) * 32U)
#define IAC_EXCEPT_MSB_BIT(x) (IAC_EXCEPT_LSB_BIT(x) + 31U)

#if DEBUG && !STM32MP_M33_TDCID
/* Save all IAC ISR registers + the number of IAC found on last u32 */
static uint32_t iac_list[IAC_NB + 1U];
#endif

static void iac_dump(void)
{
#if DEBUG && !STM32MP_M33_TDCID
	uint32_t i;

	for (i = 0U; i < IAC_NB; i++) {
		uint32_t isr = mmio_read_32(IAC_BASE + IAC_ISR(i));
		uint32_t ier = mmio_read_32(IAC_BASE + IAC_IER(i));

		isr &= ier;
		if (isr == 0U) {
			continue;
		}

		iac_list[i] = isr;
		iac_list[IAC_NB]++;
	}
#endif
}

static void iac_display(void)
{
#if DEBUG && !STM32MP_M33_TDCID
	unsigned int i;
	unsigned int bit;

	if (iac_list[IAC_NB] == 0U) {
		return;
	}

	for (i = 0U; i < IAC_NB; i++) {
		uint32_t isr = iac_list[i];

		WARN("IAC exceptions pending [%u:%u] = %x\n",
		     IAC_EXCEPT_MSB_BIT(i), IAC_EXCEPT_LSB_BIT(i), isr);
		bit = 0U;
		while ((isr != 0U) && (bit < 32U)) {
			if ((isr & BIT(0)) != 0U) {
				WARN(" - %u\n", IAC_EXCEPT_LSB_BIT(i) + bit);
			}
			isr >>= 1U;
			bit++;
		}
	}
#endif
}

#if STM32MP_UART_PROGRAMMER || STM32MP_USB_PROGRAMMER
static void clean_iac(void)
{
	uint32_t i;

	for (i = 0U; i < IAC_NB; i++) {
		mmio_write_32((IAC_BASE + IAC_ICR(i)), (uint32_t)~0U);
	}
}
#endif

static void print_reset_reason(void)
{
	uint32_t rstsr = mmio_read_32(stm32mp_rcc_base() + RCC_C1BOOTRSTSCLRR);
	const char *reason_str = "Unidentified";

#if !STM32MP21
	if ((rstsr & RCC_C1BOOTRSTSCLRR_C1P1RSTF) != 0U) {
		INFO("CA35 processor core 1 reset\n");
	}
#endif /* !STM32MP21 */

	if ((rstsr & RCC_C1BOOTRSTSCLRR_PADRSTF) == 0U) {
		if ((rstsr & RCC_C1BOOTRSTSCLRR_STBYC1RSTF) != 0U) {
			reason_str = "System exits from Standby for CA35";
		} else if ((rstsr & RCC_C1BOOTRSTSCLRR_D1STBYRSTF) != 0U) {
			reason_str = "D1 domain exits from DStandby";
		} else if ((rstsr & RCC_C1BOOTRSTSCLRR_VCPURSTF) != 0U) {
			reason_str = "System reset from VCPU monitor";
		} else if ((rstsr & RCC_C1BOOTRSTSCLRR_C1RSTF) != 0U) {
			reason_str = "CA35 reset by CM33 (C1RST)";
		} else {
			reason_str = "Unidentified";
		}
	} else {
		if ((rstsr & RCC_C1BOOTRSTSCLRR_PORRSTF) != 0U) {
			reason_str = "Power-on reset (por_rstn)";
		} else if ((rstsr & RCC_C1BOOTRSTSCLRR_BORRSTF) != 0U) {
			reason_str = "Brownout reset (bor_rstn)";
		} else if ((rstsr & (RCC_C1BOOTRSTSSETR_SYSC2RSTF |
				     RCC_C1BOOTRSTSSETR_SYSC1RSTF)) != 0U) {
			reason_str = "System reset (SYSRST)";
		} else if ((rstsr & RCC_C1BOOTRSTSCLRR_HCSSRSTF) != 0U) {
			reason_str = "Clock failure on HSE";
		} else if ((rstsr & RCC_C1BOOTRSTSCLRR_IWDGXSYSRSTF) != 0U) {
			reason_str = "IWDG system reset (iwdgX_out_rst)";
		} else if ((rstsr & RCC_C1BOOTRSTSCLRR_PADRSTF) != 0U) {
			reason_str = "Pin reset from NRST";
		} else {
			reason_str = "Unidentified";
		}
	}

	INFO("Reset reason: %s (0x%x)\n", reason_str, rstsr);
}

#if STM32MP_M33_TDCID
/*
 * notify_cpu2 sends an event (SEV) to CPU2 to notify it that BL2 has
 * finished its execution and doesn't need the RIF boot configuration
 * anymore and wait clear of pending bit to acknowledge the trasaction.
 */
static void notify_cpu2(void)
{
	/* clear CPU2 SEV event to cpu1 (exti 64)*/
	mmio_write_32(STM32MP_EXTI1_BASE + EXTI1_RPR3, EXTI1_C2SEV);

	/* Send CPU1 SEV event to cpu2 (exti 65)*/
	mmio_write_32(STM32MP_EXTI1_BASE + EXTI1_SWIER3, EXTI1_C1SEV);

	for ( ; ; ) {
		if ((mmio_read_32(STM32MP_EXTI1_BASE + EXTI1_RPR3) & EXTI1_C1SEV) == 0U) {
			break;
		}
	}
}
#endif

/*
 * Diagnostic "alive" heartbeat: directly toggle GPIO pins as a square wave to
 * prove BL2 is executing, independent of any UART/console config. Mirrors the
 * register-poke sequence proven in plat_crash_console_init().
 *   - PA4: GPIOA bank, the bank USART2 TX used and proved on the EV kit.
 *   - PB8: GPIOB bank, the USART1 TX pin on the custom board.
 * Toggling both lets a scope distinguish "BL2 dead" (both silent) from a
 * GPIOB-specific issue (only PA4 moves).
 * This loops forever - move the call later in boot to bisect where BL2 dies.
 */
#define RCC_GPIOACFGR_OFF	U(0x52C)
#define RCC_GPIOBCFGR_OFF	U(0x530)
#define RCC_GPIOxEN		BIT(1)
#define GPIO_MODER_OFF		U(0x00)
#define GPIO_BSRR_OFF		U(0x18)

/* PWR controller - de-isolate the VDDIO4 IO domain that powers GPIOB/PB8 */
#define PWR_CR1_OFF		U(0x00)
#define PWR_CR1_VDDIO4VMEN	BIT(1)	/* voltage monitor enable */
#define PWR_CR1_VDDIO4SV	BIT(9)	/* supply valid -> de-isolate pads */
/* NB: VDDIO4 is 3.3V (buck4); VRSEL (BIT 26) must stay CLEAR. */

