4ms/tf-a-stm32mp25/plat/st/stm32mp2/bl2_plat_setup.c
#ifdef SEND_GPIO_A5_HEARTBEAT
void __unused stm32mp_gpio_heartbeat(int pulses)
{
	/* Enable GPIOA bank clocks */
	mmio_setbits_32(RCC_BASE + RCC_GPIOACFGR_OFF, RCC_GPIOxEN);

	/* PA5 = general-purpose output (MODER[11:10] = 0b01) */
	mmio_clrsetbits_32(GPIOA_BASE + GPIO_MODER_OFF,
			   U(0x3) << (5 * 2), U(0x1) << (5 * 2));
	// /* PB8 = general-purpose output (MODER[17:16] = 0b01) */
	// mmio_clrsetbits_32(GPIOB_BASE + GPIO_MODER_OFF,
	// 		   U(0x3) << (8 * 2), U(0x1) << (8 * 2));

	while (pulses--) {
		mmio_write_32(GPIOA_BASE + GPIO_BSRR_OFF, BIT(5));
		for (volatile uint32_t i = 0; i < 20000U; i++) {
		}
		mmio_write_32(GPIOA_BASE + GPIO_BSRR_OFF, BIT(5) << 16);
		for (volatile uint32_t i = 0; i < 20000U; i++) {
		}
	}
}
#endif

static void __unused stm32mp_init_vddio4() {
	/*
	 * De-isolate VDDIO4 so PB8's pad buffer is driven. The pad is held
	 * isolated after reset until software declares the supply valid (SV),
	 * even though the PMIC rail is already up. No RDY poll (hang-safe: the
	 * supply is known good), no VRSEL (3.3V rail).
	 */
	mmio_setbits_32(PWR_BASE + PWR_CR1_OFF,
			PWR_CR1_VDDIO4VMEN | PWR_CR1_VDDIO4SV);
}


void bl2_el3_early_platform_setup(u_register_t arg0 __unused,
				  u_register_t arg1 __unused,
				  u_register_t arg2 __unused,
				  u_register_t arg3 __unused)
{
	bsec_enable_full_debug_conf();
	stm32mp_init_vddio4();

#ifdef SEND_GPIO_A5_HEARTBEAT
	stm32mp_gpio_heartbeat(1);
#endif

	stm32mp_setup_early_console();

#if STM32MP_M33_TDCID
	/* Synchronisation point between TF-A and TF-M */
	notify_cpu2();
#endif

	iac_dump();

#if STM32MP_UART_PROGRAMMER || STM32MP_USB_PROGRAMMER
	/*
	 * fixup: clean IAC that may be caused by bootrom. They are
	 * irrelevant in programmer mode.
	 */
	clean_iac();
#endif

	stm32mp_save_boot_ctx_address(BOOT_CTX_ADDR);

	stm32_save_header();
}

void bl2_platform_setup(void)
{
	int ret;

#if !STM32MP_M33_TDCID
	ret = stm32mp2_ddr_probe();
	if (ret != 0) {
		ERROR("DDR probe: error %d\n", ret);
		panic();
	}

	if (stm32mp2_risaf_init() < 0) {
		panic();
	}
#endif

	/* Map DDR for binary load, now with cacheable attribute */
	ret = mmap_add_dynamic_region(STM32MP_DDR_BASE, STM32MP_DDR_BASE,
				      STM32MP_DDR_MAX_SIZE, MT_MEMORY | MT_RW | MT_SECURE);
	if (ret < 0) {
		ERROR("DDR mapping: error %d\n", ret);
		panic();
	}

#if !STM32MP_M33_TDCID
	/* Set QOS ICN priority */
	stm32mp_syscfg_set_icn_qos();
#endif
}

#if !STM32MP_M33_TDCID
static void handle_potential_tamper(uint32_t bit_off)
{
	/* Fixme: Add implementation specific logic here */
	ERROR("Handling Potential tamper\n");
	mmio_setbits_32(TAMP_BASE + TAMP_SCR, BIT_32(bit_off));
}

static void handle_confirmed_tamper(uint32_t bit_off __unused)
{
	/* Fixme: Add implementation specific logic here */
	ERROR("Handling Confirmed tamper\n");
	panic();
}

static bool tamper_is_accesssible(void)
{
	uint32_t r0cidcfgr = mmio_read_32(TAMP_BASE + TAMP_R0CIDCFGR);

	return !(((r0cidcfgr & TAMP_R0CIDCFGR_CFEN) == TAMP_R0CIDCFGR_CFEN) &&
		 ((r0cidcfgr & TAMP_R0CIDCFGR_CID) != TAMP_R0CIDCFGR_CID1));
}

static bool lse_tamper_detection(void)
{
	/*
	 * In case the backup domain hasn't been reset on warm boot cases, the
	 * TAMP RIF configuration is maintained.
	 * Therefore, TAMP_SR may not be accessible. In this case skip tamper
	 * detection.
	 */
	if (!tamper_is_accesssible()) {
		return false;
	}

	if ((mmio_read_32(TAMP_BASE + TAMP_SR) & TAMP_SR_LSE_MONITORING) != 0U) {
		mmio_clrbits_32(RCC_BASE + RCC_BDCR, RCC_BDCR_LSECSSON);
		mmio_clrbits_32(RCC_BASE + RCC_BDCR, RCC_BDCR_LSEON);
		if (mmio_read_32(RCC_BASE + RCC_C1CIFCLRR) & RCC_C1CIFCLRR_LSECSSF) {
			mmio_clrbits_32(RCC_BASE + RCC_C1CIFCLRR, RCC_C1CIFCLRR_LSECSSF);
		}

		return true;
	}

	return false;
}

static void reset_backup_domain(void)
{
	uintptr_t pwr_base = stm32mp_pwr_base();
	uintptr_t rcc_base = stm32mp_rcc_base();

	/*
	 * Disable the backup domain write protection.
	 * The protection is enable at each reset by hardware
	 * and must be disabled by software.
	 */
#if STM32MP21
	mmio_setbits_32(pwr_base + PWR_BDCR, PWR_BDCR_DBP);

	while ((mmio_read_32(pwr_base + PWR_BDCR) & PWR_BDCR_DBP) == 0U) {
		;
	}
#else /* STM32MP21 */
	mmio_setbits_32(pwr_base + PWR_BDCR1, PWR_BDCR1_DBD3P);

	while ((mmio_read_32(pwr_base + PWR_BDCR1) & PWR_BDCR1_DBD3P) == 0U) {
		;
	}
#endif /* STM32MP21 */

	/* Reset backup domain on cold boot cases or when LSE tamper occurred */
	if ((mmio_read_32(rcc_base + RCC_BDCR) & RCC_BDCR_RTCCKEN) == 0U) {
		mmio_setbits_32(rcc_base + RCC_BDCR, RCC_BDCR_VSWRST);

		while ((mmio_read_32(rcc_base + RCC_BDCR) & RCC_BDCR_VSWRST) == 0U) {
			;
		}

		mmio_clrbits_32(rcc_base + RCC_BDCR, RCC_BDCR_VSWRST);
	}
}
#endif /* !STM32MP_M33_TDCID */

static void check_tamper_event(bool lse_tamper_occured)
{
#if !STM32MP_M33_TDCID
	uint32_t sr;

	/*
	 * In case the backup domain hasn't been reset on warm boot cases, the
	 * TAMP RIF configuration is maintained.
	 * Therefore, TAMP_SR may not be accessible. In this case skip tamper
	 * detection.
	 */
	if (!tamper_is_accesssible()) {
		INFO("TAMP IP not accessible, skip tamper verification\n");
		return;
	}

	sr = mmio_read_32(TAMP_BASE + TAMP_SR);
	if (sr == 0U) {
		return;
	}

	ERROR("\n");
	if (lse_tamper_occured) {
		ERROR("** INTRUSION ALERT: LSE MONITORING TAMPER DETECTED **\n");
		ERROR("\n");
		/*
		 * Fixme: Add logic to handle the LSE tamper here (e.g change RTC clock source
		 * instead). This part is implementation specific.
		 */
		mmio_clrbits_32(RCC_BASE + RCC_BDCR, RCC_BDCR_RTCCKEN);
		ERROR("** Rebooting... **\n");
		stm32mp_system_reset();
	} else {
		while (sr != 0U) {
			unsigned int bit_off = __builtin_ctz(sr);
			bool is_internal = bit_off >= TAMP_SR_INT_SHIFT;
			uint32_t cr2 = mmio_read_32(TAMP_BASE + TAMP_CR2);
			uint32_t cr3 = mmio_read_32(TAMP_BASE + TAMP_CR3);

			ERROR("** INTRUSION ALERT: %s TAMPER %u DETECTED **\n",
			      is_internal ? "INTERNAL" : "EXTERNAL",
			      is_internal ? (bit_off - TAMP_SR_INT_SHIFT + 1U) : (bit_off + 1U));

			if ((is_internal && ((cr3 & BIT_32(bit_off - TAMP_SR_INT_SHIFT)) != 0U)) ||
			    (!is_internal && ((cr2 & BIT_32(bit_off)) != 0U))) {
				handle_potential_tamper(bit_off);
			} else {
				handle_confirmed_tamper(bit_off);
			}

