4ms/tf-a-stm32mp25/plat/st/stm32mp2/bl2_plat_setup.c
			sr &= ~BIT_32(bit_off);
		}
		ERROR("\n");
	}
#endif
}

static void authentication_check(boot_api_context_t *boot_context)
{
#if TRUSTED_BOARD_BOOT && DYN_DISABLE_AUTH && !STM32MP21
	bool auth = false;

	if (boot_context->auth_status == BOOT_API_CTX_AUTH_FAILED) {
		goto end;
	}

	if (stm32mp_check_closed_device() != STM32MP_CHIP_SEC_CLOSED) {
		void *pk_ptr = NULL;
		unsigned int len = 0U;
		unsigned int flags = 0U;
		int rc;

		if (stm32_hash_register() != 0) {
			ERROR("%s: HASH register fail\n", __func__);
			return;
		}

		rc = plat_get_rotpk_info(NULL, &pk_ptr, &len, &flags);
		if ((rc != -EINVAL) && ((flags & ROTPK_NOT_DEPLOYED) == 0)) {
			auth = true;
		}
	} else {
		auth = true;
	}
end:
	NOTICE("Bootrom authentication %s\n", auth ? "succeeded" : "failed");

#endif /* TRUSTED_BOARD_BOOT && DYN_DISABLE_AUTH && !STM32MP21 */
}

void bl2_el3_plat_arch_setup(void)
{
	const char *board_model;
	boot_api_context_t *boot_context =
		(boot_api_context_t *)stm32mp_get_boot_ctx_address();
	bool serial_uart_interface __unused =
				(boot_context->boot_interface_selected ==
				 BOOT_API_CTX_BOOT_INTERFACE_SEL_SERIAL_UART);
	uintptr_t uart_prog_addr __unused;
	bool lse_tamper_occured = false;

	if (stm32_otp_probe() != 0) {
		panic();
	}

	mmap_add_region(BL_CODE_BASE, BL_CODE_BASE,
			BL_CODE_END - BL_CODE_BASE,
			MT_CODE | MT_SECURE);

	configure_mmu();

	if (dt_open_and_check(STM32MP_DTB_BASE) < 0) {
		panic();
	}

#if !STM32MP_M33_TDCID
	lse_tamper_occured = lse_tamper_detection();

	reset_backup_domain();

	/*
	 * Initialize DDR sub-system clock. This needs to be done before enabling DDR PLL (PLL2),
	 * and so before stm32mp2_clk_init().
	 */
	ddr_sub_system_clk_init();
#endif

	if (stm32mp2_clk_init() < 0) {
		panic();
	}

#if STM32MP_DDR_FIP_IO_STORAGE || TRUSTED_BOARD_BOOT
#if !STM32MP_M33_TDCID
	/*
	 * RISAB3 setup (dedicated for SRAM1)
	 *
	 * Allow secure read/writes data accesses to non-secure
	 * blocks or pages, all RISAB registers are writable.
	 * DDR firmwares are saved there before being loaded in DDRPHY memory.
	 */
	mmio_write_32(RISAB3_BASE + RISAB_CR, RISAB_CR_SRWIAD);
#endif
#endif /* STM32MP_DDR_FIP_IO_STORAGE || TRUSTED_BOARD_BOOT */

	if (stm32_tamp_nvram_init() < 0) {
		panic();
	}

#if STM32MP_UART_PROGRAMMER
	uart_prog_addr = get_uart_address(boot_context->boot_interface_instance);

	/* Disable programmer UART before changing clock tree */
	if (serial_uart_interface) {
		stm32_uart_stop(uart_prog_addr);
	}
#endif

	if (stm32_iwdg_init() < 0) {
		panic();
	}

	stm32_iwdg_refresh();

#if STM32MP_M33_TDCID
	/*
	 * boot interface instance must be forced to 2 in case of eMMC
	 * single boot device to avoid a ROM issue when M33 is TDCID.
	 */
	if (boot_context->boot_interface_selected == BOOT_API_CTX_BOOT_INTERFACE_SEL_FLASH_EMMC) {
		boot_context->boot_interface_instance = 2U;
	}
#endif

	if (stm32_save_boot_info(boot_context) != 0) {
		panic();
	}

	/* Masking potential tamper during BL2 */
	stm32mp_syscfg_mask_potential_tamper_enable();

	if (stm32mp_uart_console_setup() != 0) {
		goto skip_console_init;
	}

	iac_display();

	stm32mp_print_cpuinfo();

	board_model = dt_get_board_model();
	if (board_model != NULL) {
		NOTICE("Model: %s\n", board_model);
	}

	stm32mp_print_boardinfo();

	print_reset_reason();

	if (boot_context->auth_status != BOOT_API_CTX_AUTH_NO) {
		authentication_check(boot_context);
	}

skip_console_init:
	check_tamper_event(lse_tamper_occured);

#if !TRUSTED_BOARD_BOOT
	if (stm32mp_check_closed_device() == STM32MP_CHIP_SEC_CLOSED) {
		/* Closed chip mandates authentication */
		ERROR("Secure chip: TRUSTED_BOARD_BOOT must be enabled\n");
		panic();
	}
#endif

#if !STM32MP_M33_TDCID
	if (stm32_rng_init() != 0) {
		panic();
	}
#endif

	if (fixed_regulator_register() != 0) {
		panic();
	}

	if (dt_pmic_status() > 0) {
		initialize_pmic();

#if BAREMETAL_IMAGE_LOADER
		/*
		 * Baremetal apps have no OS to bring up regulators. Enable the
		 * GPU rail here (at its regulator-min-microvolt, 0.80V), since
		 * nothing else in BL2 consumes it. Marking it always-on in the
		 * device tree is not enough: that only prevents disabling.
		 */
		{
			struct rdev *vddgpu = regulator_get_by_name("buck3");

			if (vddgpu != NULL) {
				if ((regulator_set_min_voltage(vddgpu) != 0) ||
				    (regulator_enable(vddgpu) != 0)) {
					WARN("VDDGPU (buck3) enable failed\n");
				} else {
					INFO("VDDGPU (buck3) enabled\n");
				}
			}
		}
#endif
	}

	fconf_populate("TB_FW", STM32MP_DTB_BASE);

#if STM32MP_USB_PROGRAMMER
#if STM32MP21
	stm32_rifsc_ip_configure(STM32MP21_RIMU_OTG_HS, STM32MP21_RIFSC_OTG_HS_ID,
				 RIFSC_USB_BOOT_OTG_HS_RIMC_CONF);
#endif /* STM32MP21 */
#if STM32MP23
	stm32_rifsc_ip_configure(STM32MP2_RIMU_USB3DR, STM32MP23_RIFSC_USB3DR_ID,
				 RIFSC_USB_BOOT_USB3DR_RIMC_CONF);
#endif /* STM32MP23 */
#if STM32MP25
	stm32_rifsc_ip_configure(STM32MP2_RIMU_USB3DR, STM32MP25_RIFSC_USB3DR_ID,
				 RIFSC_USB_BOOT_USB3DR_RIMC_CONF);
#endif /* STM32MP25 */
#endif /* STM32MP_USB_PROGRAMMER */

#if !STM32MP_M33_TDCID
	/*
	 * RISAB5 setup (dedicated for RETRAM)
	 *
	 * Allow secure read/writes data accesses to non-secure
	 * blocks or pages, all RISAB registers are writable.
	 * DDR retention registers are saved there and restored
	 * when exiting standby low power state.
	 */
	mmio_write_32(RISAB5_BASE + RISAB_CR, RISAB_CR_SRWIAD);

	if (stm32mp2_pwr_init_io_domains() != 0) {
		panic();
	}
#endif

#if STM32MP_DDR_FIP_IO_STORAGE && !STM32MP_UART_PROGRAMMER && !STM32MP_USB_PROGRAMMER
	/* Skip DDR FW ID = the first image to load for standby exit */
	if (stm32mp_is_wakeup_from_standby()) {
		bl_mem_params_node_t *bl_mem_params;

		bl_mem_params = get_bl_mem_params_node(DDR_FW_ID);
		assert(bl_mem_params != NULL);
		bl_mem_params->image_info.h.attr |= IMAGE_ATTRIB_SKIP_LOADING;
	}
#endif

	stm32mp_io_setup();
}

static void prepare_encryption(void)
{
#if !STM32MP_M33_TDCID
	uint8_t mkey[RISAF_KEY_SIZE_IN_BYTES];

#if STM32MP_UART_PROGRAMMER || STM32MP_USB_PROGRAMMER
	if (stm32_rng_read(mkey, RISAF_KEY_SIZE_IN_BYTES) != 0) {
		panic();
	}
#else /* STM32MP_UART_PROGRAMMER || STM32MP_USB_PROGRAMMER */
	if (stm32mp_is_wakeup_from_standby()) {
		stm32mp_pm_get_enc_mkey_from_context(mkey);
	} else {
		/* Generate RISAF encryption key from RNG */
		if (stm32_rng_read(mkey, RISAF_KEY_SIZE_IN_BYTES) != 0) {
			panic();
		}

		stm32mp_pm_save_enc_mkey_in_context(mkey);
	}
#endif /* STM32MP_UART_PROGRAMMER || STM32MP_USB_PROGRAMMER */

#if STM32MP21
	/* Check HWKEY validity before writing RISAF encryption key*/
	if (!stm32_otp_is_hwkey_valid()) {
		ERROR("Invalid HWKEY\n");
		panic();
	}
#endif /* STM32MP21 */

	if (stm32mp2_risaf_write_encryption_key(RISAF4_INST, mkey) != 0) {
		panic();
	}

#if STM32MP21
	if (stm32mp2_risaf_write_mce_key(RISAF4_INST, mkey) != 0) {
		panic();
	}
#endif /* STM32MP21 */
#endif /* !STM32MP_M33_TDCID */
}

