4ms/tf-a-stm32mp25/plat/st/stm32mp2/bl2_plat_setup.c
/*******************************************************************************
 * This function can be used by the platforms to update/use image
 * information for given `image_id`.
 ******************************************************************************/
int bl2_plat_handle_post_image_load(unsigned int image_id)
{
	int err = 0;
	bl_mem_params_node_t *bl_mem_params = get_bl_mem_params_node(image_id);
	bl_mem_params_node_t *pager_mem_params __unused;
	const struct dyn_cfg_dtb_info_t *config_info;
	unsigned int i;
	unsigned long long ddr_top __unused;
	const unsigned int image_ids[] = {
		BL31_IMAGE_ID,
		SOC_FW_CONFIG_ID,
		BL32_IMAGE_ID,
		BL33_IMAGE_ID,
		HW_CONFIG_ID,
	};
	uint32_t otp_idx __maybe_unused;
	uint32_t otp_len __maybe_unused;
	bool wakeup_standby;

	assert(bl_mem_params != NULL);

#if STM32MP_SDMMC || STM32MP_EMMC
	/*
	 * Invalidate remaining data read from MMC but not flushed by load_image_flush().
	 * We take the worst case which is 2 MMC blocks.
	 */
	if ((image_id != FW_CONFIG_ID) &&
	    ((bl_mem_params->image_info.h.attr & IMAGE_ATTRIB_SKIP_LOADING) == 0U)) {
		inv_dcache_range(bl_mem_params->image_info.image_base +
				 bl_mem_params->image_info.image_size,
				 2U * MMC_BLOCK_SIZE);
	}
#endif /* STM32MP_SDMMC || STM32MP_EMMC */

	switch (image_id) {
	case FW_CONFIG_ID:
		if ((stm32mp_check_closed_device() == STM32MP_CHIP_SEC_CLOSED) ||
		    stm32mp_is_auth_supported()) {
			prepare_encryption();
		}

		/* Set global DTB info for fixed fw_config information */
		set_config_info(STM32MP_FW_CONFIG_BASE, ~0UL, STM32MP_FW_CONFIG_MAX_SIZE,
				FW_CONFIG_ID);
		fconf_populate("FW_CONFIG", STM32MP_FW_CONFIG_BASE);

#if STM32MP_UART_PROGRAMMER || STM32MP_USB_PROGRAMMER
		wakeup_standby = false;
#else /* STM32MP_UART_PROGRAMMER || STM32MP_USB_PROGRAMMER */
		wakeup_standby = stm32mp_is_wakeup_from_standby();
#endif /* STM32MP_UART_PROGRAMMER || STM32MP_USB_PROGRAMMER */

		/* Iterate through all the fw config IDs */
		for (i = 0U; i < ARRAY_SIZE(image_ids); i++) {
			bl_mem_params = get_bl_mem_params_node(image_ids[i]);
			if (bl_mem_params == NULL)
				continue;

			config_info = FCONF_GET_PROPERTY(dyn_cfg, dtb, image_ids[i]);
			if (config_info == NULL) {
				continue;
			}

			bl_mem_params->image_info.image_base = config_info->config_addr;
			bl_mem_params->image_info.image_max_size = config_info->config_max_size;

			/*
			 * If not going back from STANDBY (preserve the DDR in Self-Refresh)
			 * or partition not located in DDR
			 * the partitions must be loaded = remove the SKIP flag
			 */
			if (!wakeup_standby || (config_info->config_addr < STM32MP_DDR_BASE)) {
				bl_mem_params->image_info.h.attr &= ~IMAGE_ATTRIB_SKIP_LOADING;
			}

			switch (image_ids[i]) {
			case BL31_IMAGE_ID:
				bl_mem_params->ep_info.pc = config_info->config_addr;
				if (bl_mem_params->image_info.image_base == STM32MP_SYSRAM_BASE) {
					bl_mem_params->image_info.image_max_size =
						BL2_BASE - STM32MP_SYSRAM_BASE;
					INFO("BL31 max size = 0x%x (%uB)\n",
					     bl_mem_params->image_info.image_max_size,
					     bl_mem_params->image_info.image_max_size);
				}
				break;
			case BL32_IMAGE_ID:
				bl_mem_params->ep_info.pc = config_info->config_addr;

				/* In case of OPTEE, initialize address space with tos_fw addr */
				pager_mem_params = get_bl_mem_params_node(BL32_EXTRA1_IMAGE_ID);
				if (pager_mem_params != NULL) {
					pager_mem_params->image_info.image_base =
						config_info->config_addr;
					pager_mem_params->image_info.image_max_size =
						config_info->config_max_size;
				}
				break;

			case BL33_IMAGE_ID:
				bl_mem_params->ep_info.pc = config_info->config_addr;
				break;

			case HW_CONFIG_ID:
			case SOC_FW_CONFIG_ID:
				break;

			default:
				return -EINVAL;
			}
		}

#ifndef DECRYPTION_SUPPORT_none
		/* Load encryption key info before DT is unmapped */
		err = stm32_get_enc_key_otp_idx_len(&otp_idx, &otp_len);
		if (err != 0) {
			panic();
		}
#endif

		/*
		 * After this step, the BL2 device tree area will be overwritten
		 * with BL31 binary, no other data should be read from BL2 DT.
		 */

		break;

	case BL32_IMAGE_ID:
		if ((bl_mem_params->image_info.image_base != 0UL) &&
		    (optee_header_is_valid(bl_mem_params->image_info.image_base))) {
			/* BL32 is OP-TEE header */
			bl_mem_params->ep_info.pc = bl_mem_params->image_info.image_base;
			pager_mem_params = get_bl_mem_params_node(BL32_EXTRA1_IMAGE_ID);
			assert(pager_mem_params != NULL);

			err = parse_optee_header(&bl_mem_params->ep_info,
						 &pager_mem_params->image_info,
						 NULL);
			if (err != 0) {
				ERROR("OPTEE header parse error.\n");
				panic();
			}

			/* Set optee boot info from parsed header data */
			bl_mem_params->ep_info.args.arg0 = 0U; /* Unused */
			bl_mem_params->ep_info.args.arg1 = 0U; /* Unused */
			bl_mem_params->ep_info.args.arg2 = 0U; /* No DT supported */
		}
		break;

#if STM32MP_M33_TDCID
	case BL32_EXTRA1_IMAGE_ID:
		dsbsy();
		isb();
		stm32mp_unmap_ddr();
		err = mmap_add_dynamic_region(STM32MP_BL33_BASE, STM32MP_BL33_BASE,
					      STM32MP_DDR_MAX_SIZE - (STM32MP_BL33_BASE -
								      STM32MP_DDR_BASE),
					      MT_MEMORY | MT_RW | MT_NS);
		if (err != 0) {
			panic();
		}
		break;
#endif

	case BL33_IMAGE_ID:
#if PSA_FWU_SUPPORT
		err = stm32_fwu_set_boot_idx();
		if (err != 0) {
			panic();
		}
#endif /* PSA_FWU_SUPPORT */
		break;

#if BAREMETAL_IMAGE_LOADER
	case BAREMETAL_FW_ID:
		/* The descriptor is SKIP_LOADING: the app is not in the FIP.
		 * Load it from the "app" GPT partition instead, which sets
		 * image_base/image_size and ep_info.pc from the uimg header. */
		err = stm32mp_load_baremetal_app(bl_mem_params);
		if (err != 0) {
			ERROR("Failed to load the baremetal app (%d)\n", err);
			panic();
		}
		dsbsy();
		isb();
		bsec_enable_full_debug_conf();
		// isb();
		break;
#endif

	default:
		/* Do nothing in default case */
		break;
	}

	return err;
}

void bl2_el3_plat_prepare_exit(void)
{
	flush_dcache_range(BSS_START, BSS_END - BSS_START);
	flush_dcache_range(DATA_START, DATA_END - DATA_START);

	stm32mp_io_exit();

	/* Unmask potential tamper before exit */
	stm32mp_syscfg_mask_potential_tamper_disable();

	/* Increment hide protection level */
	bsec_increment_hdpl();
}
